#### ConnectorGenderType Enumeration

---

|  |
| --- |
| See Also |

Connector gender type enum

Enum of connector gender type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ConnectorGenderType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConnectorGenderType ``` |

| Visual C++ |
| --- |
| ``` public enum class ConnectorGenderType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | Undefined connector gender type |
| Male | Male connector gender type |
| Female | Female connector gender type |

# See Also

Autodesk.Revit.DB Namespace